Repository: sureues/pms
Catalog: sites/all/modules/webfm/modules/webfm_ipfolder/translations/*.po
Languages: de

source: Current IP authenticated folders
de: Derzeit über die IP authentifizierte Verzeichnisse

source: Instructions:
de: Anleitung:

source: Click on an ip range to modify the authenticator assignment.
de: Auf einen IP-Bereich klicken um diese zu bearbeiten.

source: The title fields are sortable.
de: Die Titel Felder kann man sortieren.

source: Your IP: @s
de: Ihre IP: @s

source: Please note that users with the <em>administer webfm</em> rights will be able to download the files anyway.
de: Bitte beachten: Nutzer mit der Berechtigung webfm zu verwalten (<em>administer webfm</em>) können die Dateien immer herunterladen.

source: IP Range
de: IP Bereich

source: Folder
de: Verzeichnis

source: There are no folders or IPs to list.
de: Keine IPs oder Verzeichnisse eingetragen.

source: WebFile manager IP based folder access
de: WebFile manager IP abhängiger Verzeichniszugriff.

source: Start of IP range
de: Beginn des IP-Bereichs

source: It is not possible to use wildcards.
de: Es ist nicht möglich Platzhalterzeichen zu benutzen.

source: End of IP range
de: Ende des IP-Bereichs

source: Leave empty for single IP matching of ip1
de: Leer lassen falls nur die einzelne IP aus dem Feld ip1 betroffen ist

source: Name of folder
de: Name des Verzeichnisses

source: Provide folder name as it is provided through webfm.
de: Geben Sie den Namen des Ordners genauso wie ein wie er in webfm eingegeben ist.

source: Please select your IP-Range again
de: Bitte wählen Sie Ihren IP-Bereich noch einmal.

source: You must enter an ip address in the first field.
de: Sie müssen im ersten Feld eine IP-Adresse eingeben.

source: You must enter an ip address in the second field or leave it empty.
de: Sie müssen im zweiten Feld eine IP-Adresse eingeben oder es leer lassen.

source: You must enter a folder.
de: Es wurde kein Verzeichnis angegeben.

source: Default behavior
de: Standard Verhalten

source: Block access to all folders, but not to IP/folder-Pairs specifed.
de: Zugriff auf alle Verzeichnisse beschränken, außer für die angegeben IP/Verzeichnis-Paare.

source: Allow access to all folders, but restrict access for the IP/folder-Pairs as specified.
de: Zugriff auf alle Verzeichnisse erlauben, aber für die angegeben IP/Verzeichnis-Paare beschränken wie angegeben.

source: This module extends the Web File Manager. It allows to block or allow certain IP Ranges access to specified folders. <br /> In the !configuration you can provide IP Ranges and folder names.<br /> Depending on your !settings the selected IP Range will be allowed or blocked. By default it <b>blocks</b> access to all folders.
de: Dieses Modul erweitert den Web File Manager. Es ermöglicht bestimmten IP Bereiche den Zugriff auf bestimmte Verzeichnisse zu erlauben oder zu entziehen.<br /> In der !configuration kann man bestimmte IP Bereichen Namen von Ordnern zu weisen.<br />Abhängig von den !settings wird IPs aus dem gewählten IP Block Zugriff gewährt oder blockiert. Voreingestellt ist den Zugriff auf alle Ordner zu <b>blockieren</b>.

source: Enable the Web File Manager Extension to allow IP based folder blocking.
de: Web File Manager Erweiterung aktivieren um IP-Bereich basierende Zugriffsbeschränkungen zu erlauben.

source: WebFM IP based folder access
de: WebFM IP-Bereich basierender Verzeichnis-Zugriff

source: Configure IP based folder access.
de: Konfigurieren des WebFM IP-Bereich basierenden Verzeichnis-Zugriff

source: WebFM IP based folder access -- Modify
de: WebFM IP-Bereich basierender Verzeichnis-Zugriff -- Bearbeiten

source: WebFM IP based folder access -- Delete
de: WebFM IP-Bereich basierender Verzeichnis-Zugriff -- Löschen

source: Configure IP based folder access - default behavior
de: Konfigurieren des WebFM IP-Bereich basierenden Verzeichnis-Zugriff -- Standardmäßiges Verhalten

source: configuration
de: Konfiguration
